#### CannotCopyMustBeUniqueViewport Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Multiple instances of the same view in sheets not supported. CannotCopyMustBeUniqueViewport is deprecated in Revit 2023 and may be removed in future version of Revit. Please use ViewInAModelMustBeUnique instead.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCopyMustBeUniqueViewport { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCopyMustBeUniqueViewport As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCopyMustBeUniqueViewport { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace